import 'package:flutter/material.dart';
import 'package:paymal/widget/h_empty_view.dart';
import 'package:paymal/widget/v_empty_view.dart';

import '../language_constants.dart';

class PrivacyPolicyPage extends StatefulWidget {
  PrivacyPolicyPage({Key key}) : super(key: key);

  @override
  _PrivacyPolicyPageState createState() => _PrivacyPolicyPageState();
}

class _PrivacyPolicyPageState extends State<PrivacyPolicyPage> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
          backgroundColor: Colors.blueAccent,
        title: Text(getTranslated(context, 'privacypolicy')),
      ),
      body: SingleChildScrollView(
        child: Column(
          children: [
            Padding(
              padding: const EdgeInsets.all(5.0),
              child: Text(
                  "Paymal Mobile Application နှင့်ပက်သက်၍ Privacy Policy သို့မဟုတ် ပုဂ္ဂိုလ်ရေးအချက်အလက်များ လုံခြုံမှုနှင့်စပ်လျဉ်း၍ ကျွန်ုပ်တို့၏ သဘောထားရပ်တည်ချက်အား ထုတ်ပြန်ခြင်း",style: Theme.of(context).textTheme.bodyText2,),
            ),
            VEmptyView(10),
            Padding(
              padding: const EdgeInsets.all(8.0),
              child: Text(
                  """ကျွန်ုပ်တို့သည် သင်တို့၏ပုဂ္ဂိုလ်ရေးအချက်အလက်များလုံခြုံမှုကို အလွန်တန်ဖိုးထားသည့်အားလျှော်စွာ သင့်ကိုယ်
ရေးကိုယ်တာဆိုင်ရာ သတင်းအချက်အလက်များကို အလေးအနက်ထား၍ကာကွယ်ထိန်းသိမ်းစောင့်ရှောက်ထားပါ
သည်။သို့ဖြစ်ပါ၍သင့်ကိုယ်ရေးကိုယ်တာအချက်အလက်များအား မည်သို့မည်ပုံစုဆောင်းကောက်ယူကာ မည်သို့ကိုင်
တွယ်ဆောင်ရွက်လျက်ရှိသည်များကို သင်သိရှိနားလည်စေရန်မှာလည်း ကျွန်ုပ်တို့၏ အရေးကြီးသောကိစ္စရပ်တစ်
ခုပင်ဖြစ်ပါသည်။

Paymal Mobile Application အသုံးပြုရာတွင် ဖြည့်စွက်ရသော သင့်ကိုယ်ရေးကိုယ်တာအချက်အလက်များသည် စနစ်အသုံးပြုရာတွင်လိုအပ်သော မရှိမဖြစ်အခြေခံလိုအပ်ချက်ဖြစ်သောကြောင့် မိမိတို့အနေဖြင့်သင့်ကိုယ်ရေးကိုယ်တာ
အချက်အလက်များအားလုံခြုံမှုရှိစေရေးအတွက် တားဆီးကာကွယ်ရေးအစီအမံများကို နည်းပညာအားဖြင့်လည်း
ကောင်း၊ဆက်သွယ်ရေးဆိုင်ရာတည်ဆဲဥပဒေများအနေဖြင့်လည်းကောင်း ထည့်သွင်းဆောင်ရွက်ထားရှိပါသည်။
ပြောင်းလဲလာမည့် ဥပဒေ၊နည်းဥပဒေများအားဖြင့်လည်းကောင်း အမြဲတစေစောင့်ကြည့်တားဆီးကာကွယ်ထားရှိမည်ဟု အသိပေးအပ်ပါသည်။

၁။သင့်ကိုယ်ရေးကိုယ်တာသတင်းအချက်အလက်များကိုသိမ်းဆည်းထားသည့် ကာလအတိုင်းအရှည်ကျွန်ုပ်တို့သည် သင့်
သတင်းအချက်အလက်များကို ကျွန်ုပ်တို့လိုအပ်သည်ထက် သို့မဟုတ် ဥပဒေအရလိုအပ်သည်ထက် ကြာရှည်စွာ သိမ်း
ဆည်းထားမည်မဟုတ်ပါ။

၂။သင့်ကိုယ်ရေးကိုယ်တာ သတင်းအချက်အလက်များကို ကျွန်ုပ်တို့ အကာအကွယ်ပေးထားပုံ

သင့်ကိုယ််ရေးကိုယ်တာအချက်အလက်များကို လုံခြုံစိတ်ချစွာထိန်းသိမ်းထားနိုင်ရန် Paymal Mobile Application သည် များစွာကြိုးပမ်းဆောင်ရွက််ထားပါသည်။ကမ္ဘာ့အကြီးမားဆုံးသော ဆက်သွယ်ရေးအော်ပရေတာများထဲမှ တစ်ဦးဖြစ်
သူနှင့်အတူ သင့်ကိုယ်ရေးကိုယ်တာ အချက်အလက်များမပေါက်ကြားစေဘဲ လုံခြုံစွာတည်ရှိနေရေးကို ကာကွယ်ပေး
နိုင်စေရန်ရည်ရွယ်၍ ရေးဆွဲထားသော မူဝါဒများ၊လုပ်ထုံးလုပ်နည်းများနှင့်အတူ Myanmar Payment Solution Services Co., Ltd. မှလိုက်နာဆောင်ရွက်ထားပါသည်။

၃။သင့်အခွင့်အရေး

မည်သည့်သတင်းအချက်အလက်များကို သင့်ကိုယ်စားကျွန်ုပ်တို့သိမ်းဆည်းထားသည်ကို အတိအကျသိရှိပိုင်ခွင့်နှင့် တိကျမှန်ကန်မှုမရှိသောသတင်းအချက်အလက်များကို မှန်ကန်တိကျအောင်ပြင်ဆင်ပေးရန် သို့မဟုတ် ပယ်ဖျက်ပစ်ရန်
တောင်းဆိုပိုင်ခွင့် သင့်တွင်အမြဲရှိပါသည်။

၄။ကလေးသူငယ်ဆိုင်ရာ သတင်းအချက်အလက်များနှင့်ဆက်စပ်ရှင်းလင်းချက်

ယေဘုယျဆိုရပါမူ ကျွနု်ပ်တို့ဝန်ဆောင်မှုများသည် အရွယ်မရောက်သေးသည့်ကလေးသူငယ်များကိုရည်စူးထားခြင်းမရှိ
သဖြင့် ၄င်းတို့နှင့်ဆိုင်သောအချက်အလက်များကို အထူးတလည်ကောက်ယူစုဆောင်းခြင်းများမရှိပါ။အကယ်၍ သုံးစွဲသူ
သည်အရွယ်မရောက်သေးသူဖြစ်ကြောင်းတွေ့ရှိပါက ၄င်းတို့နှင့်စပ်ဆိုင်သည့်အချက်အလက်များမှာ ကောက်ယူခြင်း
မပြုသင့်ပါသဖြင့်ကျွန်ုပ်တို့သည်ယင်းကဲ့သို့ သတင်းအချက်အလက်များကို စောနိုင်သမျှစောစီးစွာ ပယ်ဖျက်မည်ဖြစ်ပါ
ကြောင်းအသိပေးအပ်ပါသည်။
""",style: Theme.of(context).textTheme.subtitle2),
            ),
          ],
        ),
      ),
    );
  }
}
